#+title: Release Notes for Sprint 37
#+options: date:nil toc:nil author:nil num:nil
#+todo: ANALYSIS IMPLEMENTATION TESTING | COMPLETED CANCELLED
#+tags: story(s) epic(e) task(t) note(n) spike(p)

* Release Notes

This file contains all stories that were closed during sprint 37.

** Development Stories Implemented

#+begin: clocktable :maxlevel 3 :scope subtree
Clock summary at [2013-10-27 Sun 17:48]

| Headline                                                                 | Time   |      |      |
|--------------------------------------------------------------------------+--------+------+------|
| *Total time*                                                             | *8:42* |      |      |
|--------------------------------------------------------------------------+--------+------+------|
| Development Stories Implemented                                          |        | 8:42 |      |
| IMPLEMENTATION Release notes and backlog grooming                        |        |      | 0:06 |
| COMPLETED Add types header formatter to workflow                         |        |      | 4:14 |
| IMPLEMENTATION Add module support to types header formatter              |        |      | 2:12 |
| IMPLEMENTATION Add tests for properties and compiler generated functions |        |      | 0:30 |
| IMPLEMENTATION Add support for =boost::property_tree::ptree=             |        |      | 1:40 |
#+end:

*** IMPLEMENTATION Release notes and backlog grooming                  :task:
    CLOCK: [2013-10-21 Mon 07:53]--[2013-10-21 Mon 07:59] =>  0:06

*** COMPLETED Add types header formatter to workflow                  :story:
    CLOSED: [2013-10-24 Thu 20:28]
    CLOCK: [2013-10-25 Fri 07:48]--[2013-10-25 Fri 07:55] =>  0:07
    CLOCK: [2013-10-24 Thu 08:22]--[2013-10-24 Thu 08:33] =>  0:11
    CLOCK: [2013-10-24 Thu 07:51]--[2013-10-24 Thu 08:17] =>  0:26
    CLOCK: [2013-10-21 Mon 08:32]--[2013-10-21 Mon 08:40] =>  0:08
    CLOCK: [2013-10-21 Mon 08:14]--[2013-10-21 Mon 08:17] =>  0:03
    CLOCK: [2013-10-21 Mon 07:59]--[2013-10-21 Mon 08:14] =>  0:15

**** COMPLETED Change type formatter interface                         :task:
     CLOSED: [2013-10-21 Mon 20:44]
     CLOCK: [2013-10-21 Mon 19:45]--[2013-10-21 Mon 20:00] =>  0:15
     CLOCK: [2013-10-21 Mon 18:20]--[2013-10-21 Mon 18:53] =>  0:33
     CLOCK: [2013-10-21 Mon 18:19]--[2013-10-21 Mon 18:20] =>  0:01

- no stream
- returns a file

**** COMPLETED add all types traversal and hook it up to workflow      :task:
     CLOSED: [2013-10-25 Fri 00:19]
     CLOCK: [2013-10-24 Thu 22:40]--[2013-10-25 Fri 00:19] =>  1:39
     CLOCK: [2013-10-24 Thu 18:14]--[2013-10-24 Thu 18:46] =>  0:32
     CLOCK: [2013-10-24 Thu 18:10]--[2013-10-24 Thu 18:14] =>  0:04

*** IMPLEMENTATION Add module support to types header formatter       :story:
**** Add test for module in model
**** COMPLETED Generic module support                                  :task:
     CLOSED: [2013-10-27 Sun 11:33]
     CLOCK: [2013-10-27 Sun 09:39]--[2013-10-27 Sun 11:32] =>  1:53

**** COMPLETED Support model as a module                               :task:
     CLOSED: [2013-10-27 Sun 11:33]
     CLOCK: [2013-10-27 Sun 09:20]--[2013-10-27 Sun 09:39] =>  0:19

*** IMPLEMENTATION Add tests for properties and compiler generated functions :story:
    CLOCK: [2013-10-25 Fri 08:27]--[2013-10-25 Fri 08:35] =>  0:08
    CLOCK: [2013-10-25 Fri 07:56]--[2013-10-25 Fri 08:18] =>  0:22

*** IMPLEMENTATION Add support for =boost::property_tree::ptree=      :story:
    CLOCK: [2013-10-27 Sun 16:07]--[2013-10-27 Sun 17:47] =>  1:40

*** Add tests for tagging of abstract objects                         :story:

** Deprecated Development Stories
